{
  "_comment": "Compute-optimal ~48B dense model designed from get_optimal_N_D_from_cost ($5M, A100). Chinchilla-style.",
  "architectures": [
    "LlamaForCausalLM"
  ],
  "hidden_act": "silu",
  "hidden_size": 8192,
  "intermediate_size": 28672,
  "max_position_embeddings": 4096,
  "model_type": "llama",
  "num_attention_heads": 64,
  "num_hidden_layers": 49,
  "num_key_value_heads": 64,
  "rms_norm_eps": 1e-05,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "vocab_size": 32000,
  "design_notes": {
    "optimal_N": 48205946880,
    "optimal_D_tokens": 1955581178479,
    "chosen_gpu": "A100",
    "budget_usd": 5000000
  }
}